#language: zh-CN
功能: 破译者提交猜想

  破译者从1-6中选择四个数字作为猜想答案。
  游戏会反馈猜想结果：+和-。

  答案中的每个数字若在密码中存在，并且位置准确就返回一个+；若仅存在数字但位置不准确就返回一个－。

  场景大纲: 猜想匹配测试
    假如密码是"<code>"
    当我提交"<guess>"
    那么我应当得到的反馈是"<mark>"

    例子: 没有匹配
    | code | guess | mark |
    | 1234 | 5555  |      |

    例子: 1个数字正确
    | code | guess | mark |
    | 1234 | 1555  | +    |
    | 1234 | 2555  | -    |

    例子: 2个数字正确
    | code | guess | mark |
    | 1234 | 5254  | ++   |
    | 1234 | 1155  | +-   |
    | 1234 | 5154  | +-   |
    | 1234 | 2545  | --   |

    例子: 3个数字正确
    | code | guess | mark |
    | 1234 | 5234  | +++  |
    | 1234 | 5134  | ++-  |
    | 1234 | 5124  | +--  |
    | 1234 | 5123  | ---  |

    例子: 全部正确
    | code | guess | mark |
    | 1234 | 1234  | ++++ |
    | 1234 | 1243  | ++-- |
    | 1234 | 1423  | +--- |
    | 1234 | 4321  | ---- |
